# SteelElementModifyParametersTaskNotFinished Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SteelElementFailures..::..SteelElementModifyParametersTaskNotFinished Property
BuiltInFailures..::..SteelElementFailures Class See Also
---
Cannot modify parameters while background calculations are in progress.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SteelElementModifyParametersTaskNotFinished { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElementModifyParametersTaskNotFinished As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SteelElementModifyParametersTaskNotFinished {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SteelElementFailures Class
Autodesk.Revit.DB Namespace